Repository: LifeDesks/LifeDesksEducation
Catalog: sites/edulifedesks.org/modules/contributed/module_grants/translations/*.po
Languages: fr

source: Title
fr: Titre

source: Creator
fr: Créateur

source: Last updated
fr: Dernière mise à jour

source: By
fr: Par

source: Published?
fr: Publié

source: Term
fr: Terme

source: Workflow state
fr: État du workflow

source: Yes
fr: Oui

source: No
fr: Non

source: No state
fr: Pas d'état

source: No content found.
fr: Aucun contenu trouvé.

source: Showing all content <em>you created</em> and still have at least view access to, filtered by publication status.
fr: Affichage de tout le contenu que <em>vous avez créé</em> et que vous pouvez encore voir, filtré par statut de publication.

source: Showing all content <em>you created</em> and still have at least view access to.
fr: Affichage de tout le contenu que <em>vous avez créé</em> et que vous pouvez encore voir.

source: Showing all content <em>you last modified</em> and still have at least view access to, filtered by publication status.
fr: Affichage de tout le contenu que <em>vous êtes le (la) dernier(ère) à avoir modifié</em> et que vous pouvez encore voir, filtré par statut de publication.

source: Showing all content <em>you last modified</em> and still have at least view access to.
fr: Affichage de tout le contenu que <em>vous êtes le (la) dernier(ère) à avoir modifié</em> et que vous pouvez encore voir.

source: Showing all content you can <em>edit</em>, filtered by publication status.
fr: Affichage de tout le contenu que vous pouvez <em>éditer</em>, filtré par statut de publication.

source: Showing all content you can <em>edit</em>.
fr: Affichage de tout le contenu que vous pouvez <em>éditer</em>.

source: Showing all content you have at least <em>view</em> access to, filtered by publication status.
fr: Affichage de tout le contenu que vous pouvez <em>voir</em>, filtré par statut de publication.

source: Showing all content you have at least <em>view</em> access to.
fr: Affichage de tout le contenu que vous pouvez <em>voir</em>.

source: Configure behaviour when multiple content access modules are enabled
fr: Configurer le comportement lorsque plusieurs modules d'accès au contenu sont activés

source: Interpret absence of access grants as a "don't care", rather than a "deny access".
fr: Interpréter l'absence de droits d'accès comme "ignorer" plutôt que comme "interdire l'accès".

source: Only applies when two or more content access modules are enabled and one of the modules makes no statement about a node that is about to be accessed. If this box is checked, then a content access module saying nothing (via the node_access table) about the node in question will be deemed to be ok with the user having access to it. If not checked (i.e. "strict"), then a module saying nothing will be taken as a "deny access".
fr: S'applique seulement lorsque deux (ou plus) modules d'accès au contnu sont activés et que l'un des modules ne donne aucune information sur un noeud auquel on va accéder. Si cette case est cochée, si un module d'accès au contenu ne donne aucune information (par la table node_access) à propos du noeud en question, on considère qu'il autorise l'utilisateur à y accéder. Si elle n'est pas cochée ("stricte"), si un module ne donne aucune information, cela sera interprété comme "interdire l'accès".

source: OR rather than AND the access grants from multiple modules, i.e. behave like core does (for published content).
fr: Pour le contenu publié, se comporter comme le noyau, c'est à dire que les droits d'accès venant de plusieurs modules sont gérés avec un OU au lieu d'un ET.

source: Note that normally core behaviour is <strong>not</strong> what you want -- it is the reason Module Grants was written in the first place.
fr: Veuillez noter que le comportement par défaut du noyau n'est <em>pas</em> ce que vous voulez -- c'est la raison pour laquelle Module Grants a été écrite à la base.

source: You have permission to publish content of types: %moderated_types.
fr: Vous avez le droit de publier du contenu de types : %moderated_types.

source: You have permission to <em>unpublish</em> content of types: %moderated_types.
fr: Vous avez le droit de <em>dépublier</em> du contenu de types : %moderated_types.

source: You have permission to <em>(re)publish</em> content of types: %moderated_types.
fr: Vous avez le droit de <em>(re)publier</em> du contenu de types : %moderated_types.

source: View current
fr: Voir l'actuel

source: View
fr: Voir

source: Edit current
fr: Éditer l'actuel

source: Edit
fr: Éditer

source: access I Created tab
fr: accéder à l'onglet 'J'ai créé'

source: access I Last Modified tab
fr: accéder à l'onglet 'Je suis le (la) dernier(ère) à avoir modifié

source: access I Can Edit tab
fr: accéder à l'onglet 'Je peux éditer'

source: access I Can View tab
fr: accéder à l'onglet 'Je peux voir'

source: access Published tab
fr: accéder à l'onglet 'Publié'

source: access Unpublished tab
fr: accéder à l'onglet 'Non publié'

source: access All tab
fr: accéder à l'onglet 'Tout'

source: Accessible content
fr: Contenu accessible

source: I created
fr: J'ai créé

source: Published
fr: Publié

source: Unpublished
fr: Non publié

source: All
fr: Tout

source: I last modified
fr: Je suis le (la) dernier(ère) à avoir modifié

source: I can edit
fr: Je peux éditer

source: I can view
fr: Je peux voir

source: Configure how node access modules interact.
fr: Configurer comment modules d'accès aux noeuds interagissent.

source: Enables access control for unpublished content and allows modules that operate on access grants to work together in the expected way.
fr: Autorise le contrôle d'accès pour le contenu non publié et permet aux modules qui opèrent sur les droits d'accès d'agir de la manière attendue.
